DataProcessors/АР_ВыгрузкаПлатежныхПорученийИДоговоровДляСобственниковВертикали.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР_ВыгрузкаПлатежныхПорученийИДоговоровДляСобственниковВертикали</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БухДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКА</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСписания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/АР_ВыгрузкаПлатежныхПорученийИДоговоровДляСобственниковВертикали/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщить("Внимание! Необходимо указать период!");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Сохранение; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Файл Excel (*,xls; *.xlsx)|*.xls; *.xlsx|";
	//+
	//"Файл Excel 2013 (*,xlsx)|*.xlsx|"; 
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файл для сохранения бланка"; 
	
	ПутьКФайлу = "Выгрузка платежных документов и договоров собственников вертикали из 1С от " + Формат(ТекущаяДата(),"ДЛФ=Д");
	ДиалогОткрытияФайла.ПолноеИмяФайла = ПутьКФайлу;
	Если ДиалогОткрытияФайла.Выбрать() Тогда 
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла; 
		//Иначе
		//	ПутьКФайлу="";
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
	ЗаписатьФайл(ПутьКФайлу);
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьФайл(ПутьКФайлу)
	
	Эксель = Новый COMОбъект("Excel.Application");
	Книга = Эксель.WorkBooks().Add();
	
	Книга = Эксель.Application.Workbooks(1);
	Лист = Книга.WorkSheets(1); 
	Лист.Cells.Clear(); //ClearContents();
	
	Лист.Columns(2).ColumnWidth = 40;
	Лист.Columns(3).ColumnWidth = 15;
	Лист.Columns(4).ColumnWidth = 40;
	Лист.Columns(5).ColumnWidth = 20;
	Лист.Columns(6).ColumnWidth = 20;
	Лист.Columns(7).ColumnWidth = 20;
	Лист.Columns(8).ColumnWidth = 20;
	Лист.Columns(9).ColumnWidth = 35;
	//Лист.Columns(10).ColumnWidth = 40;
	
	Ячейка =  Лист.Cells(3, 2);
	Ячейка.Value = "Контрагент";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, 3);
	Ячейка.Value = "Код контрагента";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	//Ячейка =  Лист.Cells(3, 4);
	//Ячейка.Value =  "Договор аренды";
	//Ячейка.Borders.LineStyle = 1;
	//Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	//Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, 4);
	Ячейка.Value = "Договор";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	//Ячейка =  Лист.Cells(3, 5);
	//Ячейка.Value =  "Вид бух. договора";
	//Ячейка.Borders.LineStyle = 1;
	//Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	//Ячейка.WrapText = истина;

	//Ячейка =  Лист.Cells(3, 6);
	//Ячейка.Value =  "Организация";
	//Ячейка.Borders.LineStyle = 1;
	//Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	//Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, 5);
	Ячейка.Value =  "Номер платежного поручения";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, 6);
	Ячейка.Value =  "Дата платежного поручения";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, 7);
	Ячейка.Value =  "Списание(в отчете агента это - дебет)";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;

	Ячейка =  Лист.Cells(3, 8);
	Ячейка.Value =  "Поступление (в отчете агента- это кредит)";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, 9);
	Ячейка.Value =  "GUID";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Инд = 3;
	ПредКА = Неопределено;
	Для каждого Стр Из Объект.Договора Цикл
		
		Инд = Инд +	1;
		
		Если Стр.Контрагент <> ПредКА Тогда
			ПредКА = Стр.Контрагент;
			
			Ячейка =  Лист.Cells(Инд, 2);
			Ячейка.Value = Строка(Стр.Контрагент);
			Ячейка.Borders.LineStyle = 1;
			Ячейка.HorizontalAlignment = 2;
			Ячейка.WrapText = истина;
			
			Ячейка =  Лист.Cells(Инд, 3);
			Ячейка.Value = Строка(Стр.КодКА);
			Ячейка.Borders.LineStyle = 1;
			Ячейка.HorizontalAlignment = 2;
			Ячейка.WrapText = истина;
		Иначе	
						
			Ячейка =  Лист.Cells(Инд, 2);
			Ячейка.Borders.LineStyle = 1;
			
			Ячейка =  Лист.Cells(Инд, 3);
			Ячейка.Borders.LineStyle = 1;
			
		КонецЕсли;
		
		//Ячейка =  Лист.Cells(Инд, 4);
		//Ячейка.Value = Строка(Стр.ДоговорАренды);
		//Ячейка.Borders.LineStyle = 1;
		//Ячейка.HorizontalAlignment = 2;
		//Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, 4);
		Ячейка.Value = Строка(Стр.БухДоговор);
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		//Ячейка =  Лист.Cells(Инд, 5);
		//Ячейка.Value = Строка(Стр.ВидДоговора);
		//Ячейка.Borders.LineStyle = 1;
		//Ячейка.HorizontalAlignment = 2;
		//Ячейка.WrapText = истина;
		//
		//Ячейка =  Лист.Cells(Инд, 6);
		//Ячейка.Value = Строка(Стр.Организация);
		//Ячейка.Borders.LineStyle = 1;
		//Ячейка.HorizontalAlignment = 2;
		//Ячейка.WrapText = истина;

		Ячейка =  Лист.Cells(Инд, 5);
		Ячейка.Value = Строка(Стр.Номер);
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, 6);
		Ячейка.Value = Строка(Стр.Дата);
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, 7);
		Ячейка.NumberFormat = "0,00";
		Если Стр.СуммаСписания > 0 Тогда 
			Ячейка.Value = Стр.СуммаСписания;
		КонецЕсли;
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, 8);
		Ячейка.NumberFormat = "0,00";
		Если Стр.СуммаПоступления > 0 Тогда 
			Ячейка.Value = Стр.СуммаПоступления;
		КонецЕсли;
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, 9);
		Ячейка.Value = Строка(Стр.ПлатежныйДокумент.УникальныйИдентификатор());
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		
	КонецЦикла; 
	
	Попытка        
		Книга.SaveAs(ПутьКФайлу);  
		Сообщить("Файл успешно сохранен!");
	Исключение
		Сообщить(ОписаниеОшибки()+ "Файл не сохранен!");
	КонецПопытки;
	
	Эксель.Application.Quit();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	ОбрОбъект.ЗаполнитьНаСервере();
	ЗначениеВРеквизитФормы(ОбрОбъект, "Объект");
		
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Контрагенты.Ссылка КАК Контрагент
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	Справочник.Контрагенты КАК Контрагенты
	//	|ГДЕ
	//	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	//	|	И Контрагенты.Родитель = &Родитель
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДоговорыКонтрагентов.Ссылка КАК БухДоговор,
	//	|	ВТ.Контрагент
	//	|ПОМЕСТИТЬ БухДоговора
	//	|ИЗ
	//	|	ВТ КАК ВТ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//	|		ПО ВТ.Контрагент = ДоговорыКонтрагентов.Владелец
	//	|ГДЕ
	//	|	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	БухДоговора.БухДоговор КАК БухДоговор,
	//	|	БухДоговора.Контрагент КАК Контрагент,
	//	|	БухДоговора.БухДоговор.Владелец.Код КАК КодКА,
	//	|	СписаниеСРасчетногоСчета.Ссылка КАК ПлатежныйДокумент,
	//	|	СписаниеСРасчетногоСчета.НомерВходящегоДокумента КАК Номер,
	//	|	СписаниеСРасчетногоСчета.ДатаВходящегоДокумента КАК Дата,
	//	|	СписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаСписания,
	//	|	NULL КАК СуммаПоступления
	//	|ИЗ
	//	|	БухДоговора КАК БухДоговора
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	//	|		ПО БухДоговора.БухДоговор.Ссылка = СписаниеСРасчетногоСчета.ДоговорКонтрагента
	//	|ГДЕ
	//	|	СписаниеСРасчетногоСчета.Проведен = ИСТИНА
	//	|	И СписаниеСРасчетногоСчета.Дата >= &ДатаН
	//	|	И СписаниеСРасчетногоСчета.Дата <= &ДатаК
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	БухДоговора.БухДоговор,
	//	|	БухДоговора.Контрагент,
	//	|	БухДоговора.БухДоговор.Владелец.Код,
	//	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	//	|	ПоступлениеНаРасчетныйСчет.НомерВходящегоДокумента,
	//	|	ПоступлениеНаРасчетныйСчет.ДатаВходящегоДокумента,
	//	|	NULL,
	//	|	ПоступлениеНаРасчетныйСчет.СуммаДокумента
	//	|ИЗ
	//	|	БухДоговора КАК БухДоговора
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	//	|		ПО БухДоговора.БухДоговор.Ссылка = ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента
	//	|ГДЕ
	//	|	ПоступлениеНаРасчетныйСчет.Проведен = ИСТИНА
	//	|	И ПоступлениеНаРасчетныйСчет.Дата >= &ДатаН
	//	|	И ПоступлениеНаРасчетныйСчет.Дата <= &ДатаК
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Контрагент,
	//	|	Дата";
	//	
	//Запрос.УстановитьПараметр("ДатаН", Объект.Период.ДатаНачала); 
	//Запрос.УстановитьПараметр("ДатаК", Объект.Период.ДатаОкончания); 
	//Запрос.УстановитьПараметр("Родитель", Справочники.Контрагенты.НайтиПоКоду("00-006870"));
	//
	//РЗ = Запрос.Выполнить().Выгрузить();
	//
	//Объект.Договора.Загрузить(РЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщить("Внимание! Необходимо указать период!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
КонецПроцедуры
